/*
 * Приведення до булю на прикладі Boolean(value)
 */

// console.log(Boolean(0));

/*
 * Логічне І (оператор &&)
 * - Запинається на брехні
 * - Повертає те, на чому затнулося або останній операнд
 */

// console.log(5 && 'hello' && 7 && 'mango');

/*
 * Логічне АБО (оператор ||)
 * - Запинається на правді
 * - Повертає те, на чому запнулося або останній операнд
 */

// console.log(false || 0 || null || 9 || 10);

/*
 * Логічне НЕ (оператор!)
 * Робить інверсію правда > брехня та брехня > правда
 */

console.log(!'Max');